Revit 2026 API

# ElementEvaluateParameterValues Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<EvaluatedParameter> EvaluateParameterValues(
	ISet<ElementId> parameterIds
)
```
```vb
Public Function EvaluateParameterValues (
	parameterIds As ISet(Of ElementId)
) As IList(Of EvaluatedParameter)
```
```cpp
public:
IList<EvaluatedParameter^>^ EvaluateParameterValues(
	ISet<ElementId^>^ parameterIds
)
```
```fsharp
member EvaluateParameterValues :
        parameterIds : ISet<ElementId> -> IList<EvaluatedParameter>
```

#### Parameters

parameterIds ISetElementId

#### Return Value

IListEvaluatedParameter

#### Reference

Element Class

Autodesk.Revit.DB Namespace